driver-tests/bpelse/repeatuntil/RepeatuntilJbi/test/RepeatUntilWithFlow/Output.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Header/>
  <SOAP-ENV:Body>
    <someNS:item xmlns:someNS="http://j2ee.netbeans.org/wsdl/RepeatUntilWithFlow/types">
      <value>In MessageFlow Branch 1Flow Branch 2</value>
    </someNS:item>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>