driver-tests/bpelse/repeatuntil/RepeatuntilJbi/test/RepeatUntilWithFlow/Input.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:typ="http://j2ee.netbeans.org/wsdl/RepeatUntilWithFlow/types">
  <soapenv:Body>
    <typ:item>
      <value>In Message</value>
    </typ:item>
  </soapenv:Body>
</soapenv:Envelope>