driver-tests/bpelse/repeatuntil/RepeatuntilJbi/test/results/RepeatUntilWithFlow/Actual_20130325125257_S.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" 
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
    xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <item xmlns="http://j2ee.netbeans.org/wsdl/RepeatUntilWithFlow/types" xmlns:msgns="http://j2ee.netbeans.org/wsdl/RepeatUntilWithFlow">
      <value xmlns="">In MessageFlow Branch 1Flow Branch 2</value>
    </item>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>